Nealcn/stopwatch-N/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# main 任务栈 4KB（8KB 冗余，Opus 编码器需内部 RAM）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_CACHE_DEF_SIZE=1048576
# RLE 压缩字体支持（lv_font_cn_full_24 全量中文字体 3755 字必须）
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=2
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=65
CONFIG_LV_FS_STDIO_CACHE_SIZE=1048576
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_TJPGD=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_SMARTWATCH=y

# --- BLE (VoiceCube 桌面模式, 阶段二) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# NimBLE host 栈 8KB：默认 4KB 在 GATT 订阅回调 + 日志格式化时会栈溢出（设备重启）
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
# NimBLE 内存放 PSRAM：内部 RAM 需留给 Opus 编码器（43KB，PSRAM 上的编码器
# 密集读写会触发 cache 卡死 → WDT 复位，参考原 VoiceCube 工程经验）
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# --- 内存与看门狗（参考原 VoiceCube 工程 sdkconfig.defaults 的踩坑经验） ---
# WiFi 缓冲保持内部 RAM（不 TRY_ALLOCATE PSRAM）：音频 UDP 发送的 pbuf 在 PSRAM
# 时 WiFi TX DMA 访问异常（is_wapi_alloc_tx_buf 崩溃，实测）
# 小分配不再强制内部 RAM（16KB → 4KB）
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# DMA 保留区 32KB（见文末：16KB 会导致 WiFi 后 M5GFX DMA 缓冲分配失败显示崩溃）
# 允许任务栈放 PSRAM（录音任务 24KB 栈进 PSRAM，内部 RAM 留给 Opus 编码器）
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
# 中断看门狗关闭：录音/编码时短时卡顿不误复位（原版经验）
CONFIG_ESP_INT_WDT=n
# 任务看门狗超时放宽到 30s（原版经验，长录音不被误杀）
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
# Brownout 电平 5 代替 7（原版注释：防止录音时 USB 供电波动误复位）
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5=y
CONFIG_ESP32S3_BROWNOUT_DET_LVL_SEL_5=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=n
CONFIG_ESP32S3_BROWNOUT_DET_LVL_SEL_7=n

# OTA 回滚支持：dual-OTA 下 app 启动成功须 mark valid，
# 关闭时 bootloader 会把对侧 entry 写成无状态 → 崩溃重启误选空 slot 死循环
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# 堆越界检测（AI 对话录音堆损坏排查；定位后改回 DISABLED 省开销）
CONFIG_HEAP_POISONING_COMPREHENSIVE=y

# DMA 保留区 32KB（官方默认；16KB 时 WiFi 后 M5GFX DMA 缓冲分配失败显示崩溃）
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# WiFi 配置对齐 Stackchan-Newstep（esp32s3，跑通小智对话的参考工程）：
# - IRAM 优化关闭（WiFi 代码从 flash 跑，避免 IRAM/缓冲交互崩溃）
# - 接收缓冲小 + mgmt 动态（参考其稳定组合）
# - mbedtls TLS 内存走 PSRAM（省内部 RAM，TLS 握手不再挤占内部 RAM）
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# DMA 保留区 48KB（折中：Stackchan 96KB，我们内部 RAM 紧张取中值）
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=49152

# --- TLS (小智 AI 对话, 阶段三: esp-ml307 EspNetwork 的 wss/https) ---
CONFIG_ESP_TLS_USE_BUNDLE=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
